Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Configures a backup site 'nyc-site' with the provided address list
ja_jp: 提供されたアドレスリストでバックアップサイト'nyc-site'を設定します。

source: Configures a backup site 'nyc-site' with the provided client intelligence
ja_jp: 提供されたクライアントインテリジェンスでバックアップサイト'nyc-site'を設定します。

source: Configures a key store where the server's private key is located.
ja_jp: サーバーの秘密鍵が置かれている鍵ストアを設定します。

source: Configures a trust store from where the trusted certificates are going to be loaded from.
ja_jp: 信頼された証明書がロードされるトラストストアを構成します。

source: Configures an additional backup site 'lon-site' with the provided address list
ja_jp: 提供されたアドレスリストで追加のバックアップサイト'lon-site'を設定します。

source: Configures the "check active" procedure.
ja_jp: "check active" 手順を設定します。

source: Configures the `MachineFactory` and `WasmModule` instances based on the environment. `MachineFactory` can leverage build-time generated bytecode for optimal performance in production/native, and use runtime or interpreter mode during development or test. Similarly, `WasmModule` instances can be initialized with WASM metadata rather than pure WASM payload, again for better performance and memory footprint, by leveraging the build-time code generation process.
ja_jp: 環境に基づいて `MachineFactory` と `WasmModule` インスタンスを構成します。 `MachineFactory` は、本番環境やネイティブ環境で最適なパフォーマンスを得るためにビルド時に生成されたバイトコードを活用し、開発やテストの際にはランタイムモードやインタープリターモードを使用できます。同様に、 `WasmModule` インスタンスも、ビルド時のコード生成プロセスを活用することで、純粋な WASM ペイロードではなく WASM メタデータを使用して初期化でき、パフォーマンスとメモリーフットプリントを向上させることができます。

source: Configures the broker host name. You can do it per channel (using the `host` attribute) or globally using `rabbitmq-host`
ja_jp: ブローカーのホスト名を設定します。チャネルごとに (`host` 属性を使用して) 設定するか、 `rabbitmq-host` を使用してグローバルに設定できます。

source: Configures the broker password if required. You can do it per channel (using the `password` attribute) or globally using `rabbitmq-password`.
ja_jp: 必要に応じてブローカーのパスワードを設定します。チャネルごとに (`password` 属性を使用して) 設定するか、 `rabbitmq-password` を使用してグローバルに設定できます。

source: Configures the broker port. You can do it per channel (using the `port` attribute) or globally using `rabbitmq-port`. The default is `5672`.
ja_jp: ブローカーポートを設定します。チャネルごとに (`port` 属性を使用して) 設定するか、 `rabbitmq-port` を使用してグローバルに設定できます。デフォルトは `5672` です。

source: Configures the broker username if required. You can do it per channel (using the `username` attribute) or globally using `rabbitmq-username`.
ja_jp: 必要に応じてブローカーのユーザー名を設定します。チャネルごとに (`username` 属性を使用して) 設定するか、 `rabbitmq-username` を使用してグローバルに設定できます。

source: Configures the broker/router host name. You can do it per channel (using the `host` attribute) or globally using `amqp-host`
ja_jp: ブローカー/ルーターのホスト名を設定します。チャネルごとに (`host` 属性を使用して)、または `amqp-host` を使用してグローバルに実行できます。

source: Configures the broker/router password if required. You can do it per channel (using the `password` attribute) or globally using `amqp-password`.
ja_jp: 必要に応じてブローカー/ルーターのパスワードを設定します。チャネルごとに (`password` 属性を使用して)、または `amqp-password` を使用してグローバルに実行できます。

source: Configures the broker/router port. You can do it per channel (using the `port` attribute) or globally using `amqp-port`. The default is `5672`.
ja_jp: ブローカー/ルーターポートを設定します。チャネルごとに (`port` 属性を使用して)、または `amqp-port` を使用してグローバルに実行できます。デフォルトは `5672` です。

source: Configures the broker/router username if required. You can do it per channel (using the `username` attribute) or globally using `amqp-username`.
ja_jp: 必要に応じて、ブローカー/ルーターのユーザー名を設定します。チャネルごとに (`username` 属性を使用して)、または `amqp-username` を使用してグローバルに実行できます。

source: Configures the web socket URL
ja_jp: WebSocketのURLを設定します

source: Configuring
ja_jp: 設定

source: Configuring Application
ja_jp: アプリケーションの設定

source: Configuring Class Loading
ja_jp: クラスローディングの設定

source: Configuring Continuous Testing
ja_jp: 継続的テストの設定

source: Configuring Dev Services
ja_jp: Dev Servicesの設定

source: Configuring Development Mode
ja_jp: 開発モードの設定

source: Configuring Elasticsearch
ja_jp: Elasticsearchの設定

source: Configuring GraalVM
ja_jp: GraalVMの設定

source: Configuring HTTP Access Logs
ja_jp: HTTP アクセスログの設定

source: Configuring HTTPS for a HTTP server
ja_jp: HTTP サーバーの HTTPS の設定

source: Configuring HTTPS for a client
ja_jp: クライアントの HTTPS の設定

source: Configuring HTTPS for an HTTP server
ja_jp: HTTP サーバーの HTTPS の設定

source: Configuring Hibernate Reactive using the standard `persistence.xml` configuration file is not supported.
ja_jp: 標準の `persistence.xml` 設定ファイルを使用してHibernate Reactiveを設定することはサポートされていません。

source: Configuring Homebrew as a packager
ja_jp: パッケージャーとしての Homebrew の設定

source: Configuring JSON support
ja_jp: JSON サポートの設定

source: Configuring Kafka topics
ja_jp: Kafkaトピックの設定

source: Configuring Keycloak programmatically
ja_jp: Keycloak のプログラムによる設定

source: Configuring Logging
ja_jp: ロギングの設定

source: Configuring Multiple Datasources
ja_jp: 複数のデータソースの構成

source: Configuring Podman for Quarkus Dev Services and Testcontainers on Linux
ja_jp: LinuxでのQuarkus Dev ServicesとTestcontainersのためのPodmanの設定

source: Configuring Pulsar Authentication
ja_jp: Pulsar 認証の設定

source: Configuring Pulsar clients
ja_jp: Pulsar クライアントの設定

source: Configuring Quarkus
ja_jp: Quarkus の設定

source: Configuring Quarkus builds
ja_jp: Quarkusのビルドの設定

source: Configuring Quarkus to support authorization code flow
ja_jp: 認証コードフローをサポートするためのQuarkusの設定

source: Configuring Redis properties
ja_jp: Redisのプロパティの設定

source: Configuring Root Paths
ja_jp: ルートパスの設定

source: Configuring SSL/TLS
ja_jp: SSL/TLS の設定

source: Configuring STARTTLS
ja_jp: STARTTLS の設定

source: Configuring SmallRye Kafka Connector
ja_jp: SmallRye Kafka コネクターの設定

source: Configuring SmallRye Pulsar Connector
ja_jp: SmallRye Pulsar コネクターの設定

source: Configuring Smallrye Kafka Connector
ja_jp: Smallrye Kafka コネクターの設定

source: Configuring TLS
ja_jp: TLS の設定

source: Configuring TLS for gRPC clients
ja_jp: gRPC クライアント向けの TLS の設定

source: Configuring TLS for gRPC services
ja_jp: gRPC サービス向けの TLS の設定

source: Configuring User Information
ja_jp: ユーザー情報の設定

source: Configuring Well-Known OpenID Connect (OIDC) Providers
ja_jp: よく知られたOpenID Connect (OIDC) プロバイダーの構成

source: Configuring Well-Known OpenID Connect Providers
ja_jp: よく知られたOpenID Connect プロバイダーの設定

source: Configuring Your Application
ja_jp: アプリケーションの設定

source: Configuring `javac` options
ja_jp: `javac` オプションの設定

source: Configuring a default proxy
ja_jp: デフォルトプロキシーの設定

source: Configuring a trust store
ja_jp: トラストストアの設定

source: Configuring access to Datastax Luna Streaming
ja_jp: Datastax Luna Streaming へのアクセスの設定

source: Configuring access to StreamNative Cloud
ja_jp: StreamNative Cloud へのアクセスの設定

source: Configuring access to the OIDC provider endpoint
ja_jp: OIDC プロバイダーエンドポイントへのアクセス設定

source: Configuring and Using Stork Kubernetes Service Discovery
ja_jp: Stork Kubernetes Service Discoveryの設定と使用方法

source: Configuring authentication to Pulsar using mTLS
ja_jp: mTLSを使ったPulsarへの認証設定

source: Configuring backup clusters in Cross-Site Replication
ja_jp: クロスサイト・レプリケーションでのバックアップ・クラスタの構成

source: Configuring custom images for service discovery
ja_jp: サービスディスカバリー用のカスタムイメージの設定

source: Configuring for production
ja_jp: 本番環境での設定

source: Configuring gRPC code generation for dependencies
ja_jp: 依存関係の gRPC コード生成の設定

source: Configuring gRPC services to use virtual threads
ja_jp: 仮想スレッドを使用するように gRPC サービスを設定する

source: Configuring live reload compiler
ja_jp: ライブリロードコンパイラーの設定

source: Configuring mTLS
ja_jp: mTLS の設定

source: Configuring many shared permission checks is less effective than configuring unshared ones. Use shared permissions to complement unshared permission checks like in the example below.
ja_jp: 共有権限チェックを多数設定することは、共有されていない権限チェックを設定する場合よりも効果が低くなります。 以下の例のように、共有権限を使用して非共有権限チェックを補完します。

source: Configuring multiple persistence units
ja_jp: 複数の永続化ユニットを設定

source: Configuring multiple registries
ja_jp: 複数のレジストリーを設定

source: Configuring named proxies
ja_jp: 名前付きプロキシーの設定

source: Configuring on Linux
ja_jp: Linuxでの設定

source: Configuring on Win & Mac
ja_jp: WinとMacでの設定

source: Configuring origins during development can be challenging. To simplify development, consider allowing all origins in development mode only:
ja_jp: 開発中にオリジンを設定するのは困難な場合があります。 開発を簡素化するには、開発モードでのみすべてのオリジンを許可することを検討してください。

source: Configuring parameters in connection URL will override the default properties.
ja_jp: 接続URLでパラメータを設定すると、デフォルトのプロパティがオーバーライドされます。

source: Configuring parameters in the connection URL overrides the default properties.
ja_jp: 接続 URL でパラメーターを設定すると、デフォルトのプロパティーが上書きされます。

source: Configuring permissions
ja_jp: パーミッションの設定

source: Configuring reflection-free Jackson serialization
ja_jp: リフレクションなしの Jackson シリアル化の設定

source: Configuring required origins when developing a Quarkus application requiring CORS support can be difficult. In such cases, consider allowing all origins in dev mode only in order to focus on the actual development first:
ja_jp: CORSのサポートが必要なQuarkusアプリケーションを開発する際に、必要なオリジンを設定するのは難しい場合があります。 そのような場合は、まず実際の開発に集中するために、devモードでのみすべてのoriginを許可することを検討してください：

source: Configuring the AMQP Broker access
ja_jp: AMQP Broker のアクセス設定

source: Configuring the AMQP address
ja_jp: AMQP アドレスの設定

source: Configuring the Application
ja_jp: アプリケーションの設定

source: Configuring the CORS filter programmatically
ja_jp: CORS フィルターをプログラムで設定する

source: Configuring the CSRF prevention programmatically
ja_jp: プログラムによる CSRF 防止の設定

source: Configuring the Context path
ja_jp: コンテキストパスの設定

source: Configuring the Dev Service
ja_jp: Dev Service の設定

source: Configuring the HTTP server directly
ja_jp: HTTP サーバーの直接設定

source: Configuring the Infinispan client
ja_jp: Infinispanクライアントの設定

source: Configuring the Instance ID
ja_jp: インスタンスIDの設定

source: Configuring the MongoDB database
ja_jp: MongoDBデータベースの設定

source: Configuring the Native Executable
ja_jp: ネイティブ実行可能ファイルの設定

source: Configuring the OpenShift application manually
ja_jp: OpenShiftアプリケーションを手動で設定

source: Configuring the Podman service
ja_jp: Podmanサービスの設定

source: Configuring the Project Output
ja_jp: プロジェクト出力の設定

source: Configuring the Pulsar broker
ja_jp: Pulsar ブローカーの設定

source: Configuring the RabbitMQ Broker access
ja_jp: RabbitMQ ブローカーアクセスの設定

source: Configuring the RabbitMQ Exchange/Queue
ja_jp: RabbitMQ エクスチェンジ/キューの設定

source: Configuring the SMTP credentials
ja_jp: SMTP認証情報の設定

source: Configuring the UPX compression
ja_jp: UPX圧縮の設定

source: Configuring the ValidatorFactory
ja_jp: ValidatorFactoryの設定

source: Configuring the Vert.x instance
ja_jp: Vert.xインスタンスの設定

source: Configuring the `ValidatorFactory` using a `META-INF/validation.xml` file is *NOT* supported in Quarkus.
ja_jp: Quarkusでは、 `META-INF/validation.xml` ファイルを使用した `ValidatorFactory` の設定はサポートされて *いません* 。

source: Configuring the address
ja_jp: アドレスの設定

source: Configuring the application
ja_jp: アプリケーションの設定

source: Configuring the banner
ja_jp: バナーの設定

source: Configuring the cluster
ja_jp: クラスタの設定

source: Configuring the compression
ja_jp: 圧縮設定

source: Configuring the connection
ja_jp: 接続の設定

source: Configuring the endpoint to request <<user-info,UserInfo>> is the only way `quarkus-oidc` can be integrated with the providers such as GitHub.
ja_jp: <<user-info,ユーザー情報>> を要求するエンドポイントの設定 は、 `quarkus-oidc` を GitHub などのプロバイダーと統合できる唯一の方法です。

source: Configuring the endpoint to request <<user-info,UserInfo>> is the only way `quarkus-oidc` can be integrated with the providers such as `GitHib`.
ja_jp: エンドポイントに xref:user-info[UserInfo] を要求するように設定することが、 `quarkus-oidc` を `GitHib` などのプロバイダーと統合する唯一の方法です。

source: Configuring the image
ja_jp: イメージの設定

source: Configuring the incoming channel. This channel reads from Kafka.
ja_jp: 着信チャネルの設定。このチャンネルは Kafka から読み取ります。

source: Configuring the load balancer
ja_jp: ロードバランサーの設定

source: Configuring the mailer
ja_jp: mailerの設定

source: Configuring the transaction timeout
ja_jp: トランザクションタイムアウトの設定

source: Configuring the underlying caching provider
ja_jp: 基礎となるキャッシュプロバイダの設定

source: Configuring the {extension-name} Extension Security Information
ja_jp: {extension-name} エクステンションセキュリティー情報の設定

source: Configuring the {extension-name} extension security information
ja_jp: {extension-name} エクステンションのセキュリティー情報を設定する。

source: Configuring the {extension-name} extension with the necessary information to validate a JWT.
ja_jp: JWT を検証するために必要な情報を含む {extension-name} エクステンションを設定する。

source: Configuring them can be hard and require work for each of them to properly understand how they implemented OIDC.
ja_jp: それらを設定するのは大変なことで、それぞれがOIDCをどのように実装したかを正しく理解するためには、それぞれに作業が必要です。

source: Configuring transaction node name identifier
ja_jp: トランザクションのノード名識別子の設定

source: Configuring user names, secrets, and roles in the `application.properties` file is appropriate only for testing scenarios. For securing a production application, it is crucial to use a database to store this information.
ja_jp: `application.properties` ファイルでユーザー名、シークレット、およびロールを設定することは、テストシナリオにのみ適しています。 実稼働環境のアプリケーションを保護するには、データベースを使用してこの情報を保存する必要があります。

source: Configuring user names, secrets, and roles in the `application.properties` file is only suitable for testing scenarios. If you are securing an application for production, always use a database to store this information.
ja_jp: `application.properties` ファイルでユーザー名、シークレット、ロールを設定することは、テストシナリオにのみ適しています。本番用のアプリケーションを保護する場合は、必ずデータベースを使用してこの情報を保存してください。

source: Configuring user names, secrets, and roles in the application.properties file is appropriate only for testing scenarios. For securing a production application, it is crucial to use a database or LDAP to store this information. For more information you can take a look at xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence] or other mentioned in xref:security-basic-authentication-howto.adoc[Enable Basic authentication].
ja_jp: application.properties ファイルでユーザー名、シークレット、およびロールを設定することは、テストシナリオにのみ適しています。実稼働アプリケーションを保護するには、データベースまたは LDAP を使用してこの情報を格納することが重要です。詳細は、xref:security-jpa.adoc[Jakarta Persistence を備えた Quarkus Security] または xref:security-basic-authentication-howto.adoc[Basic 認証を有効にする] に記載されているその他の情報を参照してください。

source: Configuring your JDBC connection is easy, the only mandatory property is the JDBC URL.
ja_jp: JDBC 接続の設定は簡単で、必須のプロパティーは JDBC URL のみです。

source: Configuring your datasources
ja_jp: データソースの設定

source: Configuring your project
ja_jp: プロジェクトの設定

source: Configuring your project to use the Quarkus Kubernetes extension
ja_jp: Quarkus Kubernetes エクステンションを使用するようにプロジェクトを設定する

source: Confirm that every certificate but the root one is signed by the parent certificate.
ja_jp: ルート証明書以外のすべての証明書が親証明書によって署名されていることを確認します。

source: Confirm that the certificate chain's root certificate is bound to the custom JWT token's claim.
ja_jp: 証明書チェーンのルート証明書がカスタム JWT トークンのクレームにバインドされていることを確認します。

source: Confirm the chain's root certificate is also imported in the truststore.
ja_jp: チェーンのルート証明書もトラストストアにインポートされていることを確認します。

source: Confirm the client name property was updated.
ja_jp: クライアント名プロパティーが更新されたことを確認します。

source: Confirm the response JSON contains a `refresh_token` property.
ja_jp: 応答 JSON に `refresh_token` プロパティーが含まれていることを確認します。

source: Confirm the response JSON contains an `id_token` property.
ja_jp: レスポンス JSON に `id_token` プロパティーが含まれていることを確認します。

source: Congratulate the user on a job well done!
ja_jp: ユーザーの健闘を称えましょう!

source: Congratulations!
ja_jp: おめでとうございます!

source: Congratulations! You have created a tutorial that describes how to create an application that uses annotations of dubious merit from a hypothetical extension.
ja_jp: おめでとうございます! あなたは、架空のエクステンションから半信半疑のメリットを持つアノテーションを使用するアプリケーションの作成方法を説明するチュートリアルを作成しました。

source: Congratulations! You have just developed a Quarkus application with https://www.optaplanner.org/[OptaPlanner]!
ja_jp: これで、 https://www.optaplanner.org/[OptaPlanner] を使用して Quarkus アプリケーションを開発しました。

source: Congratulations! You have learned how to create and test a secure Quarkus application by combining the xref:security-built-in-authentication.adoc#basic-auth[Quarkus built-in basic HTTP authentication] with the JPA identity provider.
ja_jp: おめでとうございます。 xref:security-built-in-authentication.adoc#basic-auth[Quarkusに組み込まれたベーシックHTTP認証] とJPA IDプロバイダーを組み合わせて、安全なQuarkusアプリケーションを作成およびテストする方法について学びました。

source: Congratulations! You just added application data caching to your Quarkus application with a single line of code!
ja_jp: おめでとうございます！たった1行のコードでQuarkusアプリケーションにアプリケーションデータのキャッシングを追加できました！

source: Congratulations! You've created your first Quarkus health check procedure. Let's continue by exploring what else can be done with SmallRye Health.
ja_jp: おめでとうございます。初めてのQuarkus Health Checkプロシージャを作成しました。続けて、SmallRye Healthで他にどのようなことができるかを調べてみましょう。

source: Congratulations, you've just made a working (although somewhat unreliable) Quarkus application!
ja_jp: おめでとうございます！（多少、信頼性に欠けるものの）Quarkusアプリケーションが完成しました！

source: Connect To Database Run as a Dev Service
ja_jp: Dev Service として実行されるデータベースへの接続

source: Connect to Redis Cloud
ja_jp: Redisクラウドに接続

source: Connect to a protected endpoint anonymously:
ja_jp: 保護されたリソースを匿名で攻撃してみましょう:

source: Connect to a protected endpoint as an authorized user:
ja_jp: 認証されたユーザーとして保護されたエンドポイントに接続します:

source: Connect to it using:
ja_jp: 以下を使用して接続します。

source: Connect to the Infinispan data grid for distributed caching
ja_jp: 分散キャッシングのために Infinispan データグリッドに接続

source: Connect to the Redis server
ja_jp: Redisサーバーへの接続

source: Connecting an MCP client
ja_jp: MCP クライアントの接続

source: Connecting to Apache Cassandra or DataStax Enterprise (DSE)
ja_jp: ApacheCassandra または DataStaxEnterprise (DSE) への接続

source: Connecting to Infinispan clusters
ja_jp: Infinispanクラスタへの接続

source: Connecting to Managed Kafka clusters
ja_jp: マネージド Kafka クラスターへの接続

source: Connecting to Redis
ja_jp: Redisへの接続

source: Connecting to Redis Cloud
ja_jp: Redis クラウドへの接続

source: Connecting to a DataStax Astra Cloud Database
ja_jp: DataStaxAstra クラウドデータベースへの接続

source: Connecting to an Elasticsearch cluster
ja_jp: Elasticsearchクラスターの実行

source: Connecting to the Cassandra Database
ja_jp: Cassandra データベースへの接続

source: Connecting to the running Infinispan Server
ja_jp: 実行中のInfinispan Serverへの接続

source: Connection
ja_jp: 接続

source: Connection Health Check
ja_jp: 接続のヘルスチェック

source: Connection State
ja_jp: 接続状態

source: Connection delay
ja_jp: 接続遅延

source: Connection pool
ja_jp: コネクションプール

source: Connection pooling
ja_jp: 接続プール

source: Connection properties
ja_jp: 接続プロパティー

source: Connection retry count
ja_jp: 接続再試行回数

source: Connection time out
ja_jp: 接続タイムアウト

source: Connection to Infinispan
ja_jp: Infinispanへの接続

source: Connection to Redis
ja_jp: Redisへの接続

source: Connections to Redis are always pooled. By default, maximum number of connections in the pool is 6. This can be configured using `quarkus.redis.max-pool-size`.
ja_jp: Redis への接続は常にプールされます。 デフォルトでは、プール内の接続の最大数は 6 です。 これは `quarkus.redis.max-pool-size` を使用して設定できます。

source: Connector
ja_jp: コネクター

source: Connector auto-attachment
ja_jp: コネクターの自動アタッチ

source: Connector-specific attributes are listed in connector documentation.
ja_jp: コネクター固有の属性は、コネクターのドキュメントに記載されています。

source: Connectors are not thread-safe and should not be used concurrently. Connectors should also not be reused. If you need to create multiple connections in a row you'll need to obtain a new connector instance programmatically using `Instance#get()`:
ja_jp: コネクターはスレッドセーフではないため、同時に使用しないでください。また、コネクターを再利用することも避けるべきです。連続して複数の接続を作成する必要がある場合は、`Instance#get()` を使用してプログラムで新しいコネクターインスタンスを取得する必要があります。

source: Connectors are not thread-safe and should not be used concurrently. Connectors should also not be reused. If you need to create multiple connections in a row you'll need to obtain a new connetor instance programmatically using `Instance#get()`:
ja_jp: コネクターはスレッドセーフではないため、同時に使用しないでください。 また、コネクターの再利用もしないでください。 連続して複数の接続を作成する必要がある場合は、 `Instance#get()` を使用してプログラムで新しいコネクターインスタンスを取得する必要があります。

source: Cons
ja_jp: 短所

source: Consequently, the only way to define constraints in Quarkus is by annotating your classes.
ja_jp: したがって、Quarkusで制約を定義する唯一の方法は、クラスにアノテーションを付けることです。

source: Consider a simple in-memory `ConfigSource`:
ja_jp: 単純なインメモリ `ConfigSource` を考えてみましょう。

source: Consider the following REST client interface:
ja_jp: 次のような REST クライアントインターフェイスがあるとします。

source: Consider the following socket path: `/var/run/mysqld/mysqld.sock`.
ja_jp: 次のソケットパスを検討してください: `/var/run/mysqld/mysqld.sock`。

source: Consider the following socket path: `/var/run/postgresql/.s.PGSQL.5432`.
ja_jp: 次のソケットパスを検討してください: `/var/run/postgresql/.s.PGSQL.5432`。

source: Consider this an aspirational example. Source is more commonly included directly in the source code block. While there are advantages to including source from Java files, there are details that we have to work out regarding where referenced code should live. Help and ideas are welcome!
ja_jp: これは野心的な例と考えてください。ソースは、ソースコードブロックに直接含まれることが一般的です。Java ファイルからソースを含めることには利点がありますが、参照されたコードが存在する場所に関して解決しなければならない詳細事項があります。ヘルプやアイデアをお待ちしています。

source: Consider using the `quarkus.oidc.token.audience` property to verify the token `aud` (`audience`) claim value.
ja_jp: トークンの `aud` (`audience`) クレーム値を検証するために、 `quarkus.oidc.token.audience` プロパティーを使用することを検討してください。

source: Consider:
ja_jp: 以下だとすると、

source: Consistent formatting and release of projects
ja_jp: プロジェクトの一貫したフォーマットとリリース

source: Console DEBUG Logging except for Quarkus logs (INFO), No color, Shortened Time, Shortened Category Prefixes
ja_jp: コンソール DEBUG ログ、Quarkusのログ(INFO)を除く、カラーなし、時間短縮、カテゴリプレフィックス短縮

source: Console DEBUG logging except for Quarkus logs (INFO), no color, shortened time, shortened category prefixes
ja_jp: Quarkusのログ（INFO）以外のコンソールのDEBUGログ、色なし、短縮形の時間、カテゴリの接頭辞の短縮

source: Console log handler
ja_jp: コンソールログハンドラー

source: Consolidating the coverage for all your tests
ja_jp: 全テストのカバレッジを統合する

source: Constant name
ja_jp: 定数名

source: Constraint validators as beans
ja_jp: Beanとしての制約バリデーター

source: Constraints
ja_jp: 制約

source: Constraints are added on fields, and when an object is validated, the values are checked. The getter and setter methods are also used for JSON mapping.
ja_jp: フィールドに制約を加え、オブジェクトが検証されると値がチェックされます。ゲッターメソッドとセッターメソッドはJSONマッピングにも使われています。

source: Construct the array list whose size should be observed.
ja_jp: サイズを監視する必要のある配列リストを構築します。

source: Constructor injection of the `Meter` instance.
ja_jp: `Meter` インスタンスのコンストラクター注入。

source: Constructor parameter injection
ja_jp: コンストラクタパラメータ・インジェクション

source: Constructors (optional) should always call `super` first and then set the default values for the properties.
ja_jp: コンストラクター (オプション) は必ず最初に `super` を呼び出し、次にそのプロパティーのデフォルト値を設定する必要があります。

source: Consul Client
ja_jp: Consul クライアント

source: Consume Configuration from Consul
ja_jp: Consulから設定を消費する

source: Consume Configuration from Google Cloud Secret Manager
ja_jp: Google Cloud Secret Managerから設定を読み取る

source: Consume events
ja_jp: イベントの消費

source: Consume libraries from public CDNs such as cdnjs, unpkg, jsDelivr and more, or copy them to your `META-INF/resources` directory.
ja_jp: cdnjs、unpkg、jsDelivr などのパブリック CDN からライブラリーを使用するか、それらを `META-INF/resources` ディレクトリーにコピーします。

source: Consume messages (instead of events)
ja_jp: （イベントの代わりに）メッセージを消費

source: Consume the Jandex index
ja_jp: Jandexインデックスの消費

source: Consume the `BeanContainerBuildItem` to order this build step to run after the CDI bean container has been created.
ja_jp: `BeanContainerBuildItem` を使用して、CDI Bean コンテナーが作成された後にこのビルドステップを実行するように命令します。

source: Consume the `TestBeanBuildItem`s produced from the scanning build step.
ja_jp: スキャンビルドステップから生成された `TestBeanBuildItem` を消費します。

source: Consumer Groups
ja_jp: コンシューマーグループ

source: Consumer Rebalance Listener
ja_jp: コンシューマーリバランスリスナー

source: Consumer name
ja_jp: コンシューマー名
